ICOFOAM/HagenPouiselle_Automatizado/HagenPouiselle_Malha4_P110/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          15;
        startFace       4335;
    }
    outlet
    {
        type            patch;
        nFaces          15;
        startFace       4350;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       4365;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4500;
        startFace       4665;
    }
)

// ************************************************************************* //
